atw10ez0/RadioLib/src/hal/Stm32CubeWl/Stm32WlCubeHal.cpp


#include "Stm32WlCubeHal.h"


Stm32WlCubeHal::Stm32WlCubeHal()
  : RadioLibHal(INPUT, OUTPUT, LOW, HIGH, RISING, FALLING) {
}

void Stm32WlCubeHal::setPinMap(const StmPinConfig_t* pinMap, size_t size) {
  _pinMap = pinMap;
  _pinMapSize = size;
}

void Stm32WlCubeHal::setRfSwitchCallback(RfSwitchCallback_t cb) {
  _rfSwitchCb = cb;
}

void Stm32WlCubeHal::pinMode(uint32_t pin, uint32_t mode) {
  // Virtual pins are configured automatically by the hardware
  switch(pin) {
    case RADIOLIB_STM32WL_VIRTUAL_PIN_NSS:
    case RADIOLIB_STM32WL_VIRTUAL_PIN_BUSY:
    case RADIOLIB_STM32WL_VIRTUAL_PIN_IRQ:
    case RADIOLIB_STM32WL_VIRTUAL_PIN_RESET:
      return;
    default:
      break;
  }

  // Handle physical pins via the pin map
  if (_pinMap != nullptr && pin < _pinMapSize) {
    // Removed "{0}" initialization to resolve -Wmissing-field-initializers warning in C++20
    GPIO_InitTypeDef cfg;
    cfg.Pin = _pinMap[pin].pin;
    cfg.Mode = (mode == OUTPUT) ? GPIO_MODE_OUTPUT_PP : GPIO_MODE_INPUT;
    cfg.Pull = GPIO_NOPULL;
    cfg.Speed = GPIO_SPEED_FREQ_LOW;
    cfg.Alternate = 0;
    HAL_GPIO_Init(_pinMap[pin].port, &cfg);
  }
}

void Stm32WlCubeHal::digitalWrite(uint32_t pin, uint32_t value) {
  switch (pin) {
    case RADIOLIB_STM32WL_VIRTUAL_PIN_NSS:
      // The SubGHz NSS is active LOW. Managed via the Power Control Register (PWR)
      if (value == LOW) {
        PWR->SUBGHZSPICR &= ~PWR_SUBGHZSPICR_NSS;
      } else {
        PWR->SUBGHZSPICR |= PWR_SUBGHZSPICR_NSS;
      }
      return;

    case RADIOLIB_STM32WL_VIRTUAL_PIN_RESET:
      // SubGHz Radio Reset is managed via the RCC Control/Status Register
      if (value == LOW) {
        RCC->CSR |= RCC_CSR_RFRST;
      } else {
        RCC->CSR &= ~RCC_CSR_RFRST;
      }
      return;

    case RADIOLIB_STM32WL_VIRTUAL_PIN_BUSY:
    case RADIOLIB_STM32WL_VIRTUAL_PIN_IRQ:
      // Read-only internal signals; ignore writes
      return;

    default:
      break;
  }

  // Handle physical pins via the pin map
  if (_pinMap != nullptr && pin < _pinMapSize) {
    HAL_GPIO_WritePin(_pinMap[pin].port, _pinMap[pin].pin, value ? GPIO_PIN_SET : GPIO_PIN_RESET);
  }
}

uint32_t Stm32WlCubeHal::digitalRead(uint32_t pin) {
  switch (pin) {
    case RADIOLIB_STM32WL_VIRTUAL_PIN_BUSY:
      // The RFBUSYS flag in the Power Control Register 2 indicates the radio state
      return (PWR->SR2 & PWR_SR2_RFBUSYS) ? HIGH : LOW;

    case RADIOLIB_STM32WL_VIRTUAL_PIN_IRQ:
      // The internal Radio IRQ is mapped directly to the NVIC (Interrupt 50)
      // Polling the pending state effectively reads the hardware IRQ line
      return HAL_NVIC_GetPendingIRQ(SUBGHZ_Radio_IRQn) ? HIGH : LOW;

    case RADIOLIB_STM32WL_VIRTUAL_PIN_NSS:
      return (PWR->SUBGHZSPICR & PWR_SUBGHZSPICR_NSS) ? HIGH : LOW;

    case RADIOLIB_STM32WL_VIRTUAL_PIN_RESET:
      // If the hardware reset bit is currently active, the logic state is LOW
      return (RCC->CSR & RCC_CSR_RFRST) ? LOW : HIGH;

    default:
      break;
  }

  // Handle physical pins via the pin map
  if (_pinMap != nullptr && pin < _pinMapSize) {
    return HAL_GPIO_ReadPin(_pinMap[pin].port, _pinMap[pin].pin) == GPIO_PIN_SET ? HIGH : LOW;
  }

  return LOW;
}

void Stm32WlCubeHal::attachInterrupt(uint32_t interruptNum, void (*interruptCb)(void), uint32_t mode) {
  // RadioLib handles internal polling via digitalRead() on the VIRTUAL_PIN_IRQ.
  // Standard GPIO EXTI attachments are not used for the internal radio.
  (void)interruptNum;
  (void)interruptCb;
  (void)mode;
}

void Stm32WlCubeHal::detachInterrupt(uint32_t interruptNum) {
  (void)interruptNum;
}

void Stm32WlCubeHal::delay(RadioLibTime_t ms) {
  HAL_Delay(ms);
}

void Stm32WlCubeHal::delayMicroseconds(RadioLibTime_t us) {
  uint32_t start = HAL_GetTick();
  // Rough approximation since HAL_GetTick provides ms resolution
  while ((HAL_GetTick() - start) < (us / 1000 + 1));
}

RadioLibTime_t Stm32WlCubeHal::millis() {
  return HAL_GetTick();
}

RadioLibTime_t Stm32WlCubeHal::micros() {
  return HAL_GetTick() * 1000UL;
}

void Stm32WlCubeHal::spiBegin() {
  // Initialization is provided by MX_SUBGHZ_Init() in CubeMX
}

void Stm32WlCubeHal::spiBeginTransaction() {
}

void Stm32WlCubeHal::spiTransfer(uint8_t* out, size_t len, uint8_t* in) {
  // Direct register access for optimal performance on the internal SPI bus
  for (size_t i = 0; i < len; i++) {
    uint8_t dataOut = out ? out[i] : 0x00;

    // Wait until TX buffer is empty
    while ((SUBGHZSPI->SR & SPI_SR_TXE) == 0);
    *((__IO uint8_t *)&SUBGHZSPI->DR) = dataOut;

    // Wait until RX buffer has data
    while ((SUBGHZSPI->SR & SPI_SR_RXNE) == 0);
    uint8_t dataIn = *((__IO uint8_t *)&SUBGHZSPI->DR);

    if (in) {
      in[i] = dataIn;
    }
  }
}

void Stm32WlCubeHal::spiEndTransaction() {
}

void Stm32WlCubeHal::spiEnd() {
}

void Stm32WlCubeHal::tone(uint32_t pin, unsigned int frequency, RadioLibTime_t duration) {
  (void)pin;
  (void)frequency;
  (void)duration;
}

void Stm32WlCubeHal::noTone(uint32_t pin) {
  (void)pin;
}

void Stm32WlCubeHal::yield() {
}

uint32_t Stm32WlCubeHal::pinToInterrupt(uint32_t pin) {
  return pin;
}


long Stm32WlCubeHal::pulseIn(uint32_t pin, uint32_t state, RadioLibTime_t timeout) {
  (void)pin;
  (void)state;
  (void)timeout;
  return 0;
}